console.log("I am in data");
const articles = [
  {
    id: 1,
    title: 'from मनुस्मृतिः',
    date: new Date(2024, 5, 8),
    length: 4,
    snippet: `<h3>वृतं यत्नेन संरक्षेद् वित्तमेति च याति च।</h3>
              <h3>अक्षीणो वित्ततः क्षीणो वृत्ततस्तु हतो हतः।।</h3>
              <h5><span>अर्थ:- </span>धन तो आता और जाता रहता है (पर) अपने चरित्र की रक्षा यत्नपूर्वक करनी चाहिए। 
              धन से क्षीण हो जाने पर भी मनुष्य नष्ट नहीं होता; पर यदि उसका चरित्र नष्ट हो गया तो वह 
              संपूर्णतः नष्ट हो गया ।</h5>`,
  },
  {
    id: 2,
    title: 'from विदुरनीतिः',
    date: new Date(2024, 5, 8),
    length: 3,
    snippet: `<h3>श्रूयतां धर्म सर्वस्वं श्रुत्वा चैवावधार्यताम्।</h3>
              <h3>आत्मन्: प्रतिकूलानि परेषां न समाचरेत्।।</h3>
              <h5><span>अर्थ:- </span>(हे लोगो) धर्म का सार सुनिये। सुन कर समझ लें कि जो (व्यवहार) अपने लिये प्रतिकूल लगे, उसे दूसरों के प्रति आचरण न करे।</h5>`,
  },
  {
    id: 3,
    title: 'from चाणक्यनीतिः',
    date: new Date(2024, 5, 8),
    length: 5,
    snippet: `<h3>प्रियवाक्यप्रदानेन सर्वे तुष्यन्ति जन्तवः।</h3>
              <h3>तस्माद् तदेव वक्तव्यं वचने का दरिद्रता।।</h3>
              <h5><span>अर्थ:- </span>सभी प्राणी मधुर वचनों के बोलने से प्रसन्न होते हैं। अतः वैसा ही बोलना चाहिये। (मधुर) बोलने मे कैसी कंजूसी?</h5>`,
  },
  {
    id: 4,
    title: 'from संस्कृत साहित्य',
    date: new Date(2024, 5, 8),
    length: 2,
    snippet: `<h3>विद्या विवादाय धनं मदाय शक्तिः परेषां परिपीडनाय।​</h3>
              <h3>खलस्य साधोर्विपरीतमेतत् ज्ञानाय दानाय च रक्षणाय।</h3>
              <h5><span>अर्थ:- </span> दुष्टों के लिए विद्या विवाद के लिए, धन घमंड करने के लिए ओर शक्ति दूसरो को परेशान 
              करने के लिए होती हैं इसके विपरित साधुओं के लिए विद्या ज्ञान के लिए, धन दान के लिए और 
              शक्ति दूसरो की रक्षा करने के लिए होती हैं।</h5>`,
  },
];
console.log(articles);
 const sloks = articles.map(function(article){
        return `<article class="post">
        <div class="post-info">
          <h2>${article.title}</h2>
          <span>${article.date.toDateString()}</span>
          <span>${article.length} min</span>
        </div>
        <p class="content">${article.snippet}</p>
      </article>`
      
 }).join(' ');
 console.log(sloks);
 const section = document.querySelector(".articles");
 section.innerHTML= sloks;
